"""
0과 1로 이루어진 문자열 s에서
연속된 하나 이상의 숫자를 바꾸어
모두 같은 수로 만드는 최소 횟수?

ex)
s = 0001100
1. 전체를 바꾸면 1110011
2. 4 ~ 5번째 문자를 바꾸면 1111111이 되어 두 번 만에 모두 같은 숫자됨.

but 처음부터 4 ~ 5번째 문자만 0으로 바꾸면 한 번에 0000000이 되어 1번 만에 모두 같은 숫자로 만들 수 있음.

input
0001100

expected output
1

입력값을 앞에서부터 하나씩 확인하며 0에서 1로 변경하거나 1에서 0으로 변경하는 횟수를 각각 증가시키면 됨.
계산을 마친후 다음 숫자를 '0으로 바꾸는 횟수'와 '1로 바꾸는 횟수' 중 적은 값을 반환하면 됨.
"""


def exampleAnswer():
    data = input()
    count0 = 0  # 다음 숫자를 0으로 바꾸는 횟수
    count1 = 0  # 다음 숫자를 1로 바꾸는 횟수

    # 첫 번째 숫자에 대해서 처리
    if data[0] == "1":  # 숫자가 1일 경우 0으로 바꾸기 때문에 count0 증가
        count0 += 1
    else:  # 숫자가 0일 경우 1로 바꾸기 때문에 count1 증가
        count1 += 1

    # 현재 숫자와 다음 숫자를 대조하며 처리
    for i in range(len(data) - 1):
        if data[i] != data[i + 1]:
            # 다음 숫자가 1인 경우 다음 숫자를 0으로 바꾸는 횟수 증가
            if data[i + 1] == "1":
                count0 += 1
            # 다음 숫자가 0인 경우 다음 숫자를 1로 바꾸는 횟수 증가
            else:
                count1 += 1

    return min(count0, count1)


print("exampleAnswer", exampleAnswer())
